% 例程 5.15  加权调度示例
sch = [];
global  M  pred;
M = 10000*ones(8, 1);  %  初始化记忆数组（10000标记未计算/空值）
pred = zeros(8, 1);
%  活动信息（已按结束时间排序）
%  [开始时间, 结束时间, 收益]
A(1, :) = [1, 4, 3];
A(2, :) = [3, 5, 2];
A(3, :) = [0, 6, 1];
A(4, :) = [4, 7, 9];
A(5, :) = [3, 8, 3];
A(6, :) = [5, 9, 5];
A(7, :) = [6, 10, 6];
A(8,: ) = [8, 11, 4];
%  计算p(j)（与第j项活动相容的最大索引前驱活动）
p = zeros(8, 1);
for j = 8: -1: 2
    i = j;
    nn = 0;
    while (nn == 0)
        if (A(i, 2) > A(j, 1))
            i = i - 1;
            if (i == 0)
                nn = 1;
            end
        else
            p(j) = i;
            nn = 1;
        end
    end
end
%  执行记忆化算法
M_opt(8, A, p);
profit = max(M);
%  还原最优调度方案
j = 8;
while (j > 0)
    if (pred(j) == p(j))
        sch = [j, sch];  %  将活动编号加入调度列表（前置拼接保持顺序）
    end
    j = pred(j);
end
%  输出结果
profit
sch
