% 例程 6.14  极点配置示例
%  基于状态反馈的极点配置示例
%  调用place()函数实现
%  系统矩阵
A = [1, 0.1; 0, 1];
B = [0.005; 0.1];
%  期望极点（特征值）
p1 = 0.6;
p2 = 0.8;
P = [p1; p2];
%  求解反馈增益
K = place(A, B, P);  %  反馈增益矩阵
%  计算该反馈下系统的暂态响应
x = zeros(2, 50);
u = zeros(1, 50);
x0 = [10; 10];  %  初始状态
x(:, 1) = x0;
for nn = 1:49
    u(:, nn) = -K*x(:, nn);
    x(:, nn + 1) = (A*x(:, nn )) + (B*u(:, nn));
end
%  显示系统暂态响应
figure(1)
subplot(1, 2, 1)
plot(x0(1), 'ko');  hold on;  %  初始点
plot(x(1, :), 'r-');
ylabel('状态x1');  xlabel('迭代步数');
axis([0, 50, 0, 12]);
subplot(1, 2, 2)
plot(x0(2), 'ko'); hold on;  %  初始点
plot(x(2, :), 'r-');
ylabel('状态x2');  xlabel('迭代步数');
axis([0, 50, -15, 12]);
%  输出反馈增益结果
K
