% 例程 11.2  禁忌搜索示例
%  城市对应编号：1-纽约 - (2)-洛杉矶 - (3)-芝加哥 - (4)-凤凰城 - (5)-丹佛
%  - (6)-达拉斯 - (7)-西雅图 - (8)-圣路易斯 - (9)-明尼阿波利斯 - (10)-休斯顿
%  城市间距离（单位：英里）—对称矩阵：
D = zeros(10, 10);
D(1, :) = [0, 2451, 713, 2145, 1631, 1374, 2408, 875, 1018, 1420];
D(2, :) = [2451, 0, 1745, 357, 831, 1240, 959, 1589, 1524, 1374];
D(3, :) = [713, 1745, 0, 1453, 920, 803, 1737, 262, 355, 940];
D(4, :) = [2145, 357, 1453, 0, 586, 887, 1114, 466, 1280, 1017];
D(5, :) = [1631, 831, 920, 586, 0, 663, 1021, 796, 700, 879];
D(6, :) = [1374, 1240, 803, 887, 663, 0,1681, 547, 862, 225];
D(7, :) = [2408, 959, 1737, 1114, 1021, 1681, 0, 1724, 1395, 1891];
D(8, :) = [875, 1589, 262, 466, 796, 547, 1724, 0, 466, 679];
D(9, :) = [1018, 1524, 355, 1280, 700, 862, 1395, 466, 0, 1056];
D(10, :) = [1420, 1374, 940, 1017, 879, 225, 1891, 679, 1056, 0];
for i = 1:10
    D(i, i) = 100000;  %  对角线惩罚
end
Daux = D;
%  初始化
tour = zeros(1, 8);
%  用最近邻算法构建初始路径
k = 1;
Tdist = 0;
Daux(:, 1) = 100000;  %  锁定起点
for  n = 1:9
    [mindist, ix] = min(Daux(k, :));
    Tdist = Tdist + mindist;  %  累加至总距离
    tour(n) = ix;  %  记录新目的地
    Daux(:, ix ) = 100000;  %  标记已访问，禁止重复访问
    k = ix;
end
Tdist = Tdist + D(ix, 1);
disp('初始旅行路径（从纽约出发并返回纽约）：');
tour
disp('总距离：');
Tdist
%  通过两两交换优化路径，同时更新禁忌表
%  禁忌表（仅上三角存储禁忌时长）
Tbt = zeros(9, 9);
%  交换评估表（仅使用上三角）
SE = zeros(9, 9);
%  开始迭代
ff = 1;  %  终止标志：1-继续，0-终止
while (ff == 1)
    TdistREF = Tdist;
    %  评估当前路径的所有两两交换
    for  i = 1:9
        for  j = (i + 1):9
            ixo = 1;
            ntour = tour;
            Tdist = 0;
            ntour(i) = tour(j);
            ntour(j) = tour(i);  %  路径交换
            for  n = 1:9
                ixf = ntour(n);
                Tdist = Tdist + D(ixo, ixf);
                ixo = ixf;
            end
            Tdist = Tdist + D(ixf, 1);
            SE(i, j) = Tdist - TdistREF;
            %  对禁忌移动施加惩罚
            if (Tbt(i, j) > 0)
                SE(i, j) = 100000;
            end
        end
    end
    %  寻找最优非禁忌交换
    Vaux = min(min(SE));  %  最优距离变化值
    if (Vaux == 0)
        Tbt  %  打印最终禁忌表
        ff = 0  %  设置终止标志
    else
        %  更新禁忌表
        for  i  = 1: 9
            for  j = 1: 9
                if Tbt (i, j) > 0
                    Tbt(i, j) = Tbt(i, j) - 1;
                end
            end
        end
        %  找到最优交换在SE中的位置
        [ii, jj] = find(SE == Vaux);
        ntour = tour;
        %  执行最优交换
        ntour(ii) = tour(jj);
        ntour(jj) = tour(ii);
        tour = ntour;  %  接受新路径
        Tbt(ii, jj) = 3;  %  标记该交换为禁忌，时长设为3
        ntour  %  打印当前最优路径
        Tdist = TdistREF + Vaux  %  更新总距离，Vaux为负值
    end
end
