% 例程 2.5  区间对分法的收敛性验证
%  函数：y = (1.6*sin(x)) - x
%  由区间搜索法确定的初始区间
L = 0.16;
xh = 1.12;
xl = xh - (2*L);
%  在定位区间内绘制函数曲线
x = xl: 0.01: xh;
y = (1.6*sin(x)) - x;
vb = zeros(1, 20);  %  预分配向量内存（存储20次迭代的中点b值）
for n = 1:20  %  限定搜索迭代次数为20步
b = (xh - L);  %  计算当前区间中点
yb = (1.6*sin(b)) - b;
a = b - (L/2);  %  计算左内点（中点左侧1/2步长处）
ya = (1.6*sin(a)) - a;
c = b + (L/2);  %  计算右内点（中点右侧1/2步长处）
yc = (1.6*sin(c)) - c;
if ya > yb
xh = b;  %  若左内点函数值更大，舍弃第3、4子区间，更新上界
elseif yc > yb
xl = b; %  若右内点函数值更大，舍弃第1、2子区间，更新下界
else
xl = a; xh = c; %  否则保留第2、3子区间，同时更新上下界
end;
L = L/2;
vb(n) = b;
%  结果可视化展示
figure(1)
plot(vb, 'k');
title('中点b的迭代演化过程');
end;
