% 例程 2.7  斐波那契法的收敛性验证
%  函数：  y = (1.6*sin(x)) - x
%  由区间搜索法确定的初始区间：
L = 0.16;
xh = 1.12 ; xl = xh - (2*L);
%  在定位区间内绘制函数曲线
x = xl: 0.01: xh;
y = (1.6*sin (x)) - x;
vm = zeros(1, 20);  %  预分配向量内存（存储20次迭代的区间中点值）
D = 2*L;
F1 = 8;  F0 = 5;  %  初始斐波那契数（可修改）
for n = 1:20  %  限定搜索迭代次数为20步
    F2 = F1 + F0;
    r = F0/F2;
    a = xl + (r*D);
    ya = (1.6*sin(a)) - a ;
    b = xh - (r*D);
    yb = (1.6*sin(b)) - b;
    if yb < ya
        xh = b;  %  若右内点函数值更小，舍弃第三个子区间，更新上界
    else
        xl = a;  %  否则舍弃第一个子区间，更新下界
    end
    F0 = F1;
    F1 = F2;
    D = xh - xl;
    vm(n) = (xh + xl)/2;
    %  结果可视化展示
    figure(1)
    plot(vm, 'k');
    title('中点的变化');
end
