% 例程 2.11  三次插值模型的应用
%  函数：y = 2.1*x^3 + 7/x，区间范围 [0.2, 2]
%  第一步：绘制函数曲线
x = 0.2: 0.01: 2;
y = (2.1*(x.^3)) + (7./x);
figure(1)
plot(x, y, 'k');
hold on;
%  选取2个采样点
x1 = 0.4;
y1 = (2.1*(x1^3)) + (7/x1);
yd1 = (6.3*(x1^2)) - (7/(x1^2));
x2 = 1.4;
y2 = (2.1*(x2^3)) + (7/x2);
yd2 = (6.3*(x2^2)) - (7/(x2^2));
%  通过线性方程组 Ac = b 求解三次模型系数
A = [1, x1, x1^2, x1^3; ...
    0, 1, 2*x1, 3*(x1^2); ...
    1, x2, x2^2, x2^3; ...
    0, 1, 2*x2, 3*(x2^2)];
b = [y1; yd1; y2; yd2];
c = A\b;
%  绘制三次插值模型曲线与2个采样点
x = 0.3: 0.01: 1.9;  %  模型曲线的绘制区间（更短的取值范围）
M = c(1) + (c(2).*x) + (c(3)*(x.^2)) + (c(4)*(x.^3));
plot(x, M, 'r--');
plot(x1, y1, 'bo', 'MarkerSize', 10);
plot(x2, y2, 'bo', 'MarkerSize', 10);
%  计算并绘制三次模型的极小值点
mx = (-c(3) + sqrt(c(3)^2 - (3*c(2)*c(4))))/(3*c(4));
my = c(1) + (c(2)*mx) + (c(3)*mx^2) + (c(4)*mx^3);
plot(mx, my, 'rd', 'MarkerSize', 10);
%  计算并绘制原函数在mx处的函数值
qy = (2.1*(mx^3)) + (7/mx);
plot(mx, qy, 'b*', 'MarkerSize', 10);
mx
