% 例程 2.3  二分法的收敛性
%  函数：y = (1.6*sin(x)) - x
%  由区间搜索法确定的初始区间：
L = 0.16;
xh = 1.12;
xl = xh - (2*L);
%  在定位区间内绘制函数曲线（用于可视化）
x = xl: 0.01: xh;
y = (1.6*sin(x)) - x;
vxm = zeros(1 ,20);  %  预分配向量内存（存储20次迭代的中点值）
for n = 1:20  %  限定搜索迭代次数为20步
    xm = (xh - L);  %  计算当前区间中点
    a = xm - (L/3);  %  左内点（三等分区间的第一个分点）
    ya = (1.6*sin(a)) - a;
    b = xm + (L/3);  %  右内点（三等分区间的第二个分点）
    yb = (1.6*sin(b)) - b;
    if yb < ya
        xh = b;  %  若右内点函数值更小，舍弃最右侧子区间，更新上界
    end
    L = 2*L/3;
    vxm(n) = xm; %  将当前中点值存入向量
end
xm
%  结果可视化
figure(1)
plot(vxm, 'k');
title('xm的迭代演化过程');
