% 例程 2.2  二分法
%  本例程实现二分法以精确定位极值点
%  函数：y = (1.6*sin(x)) - x
%  由区间搜索法确定的初始区间：
L = 0.16;
xh = 1.12;
xl = xh - (2*L);
%  在定位区间内绘制函数曲线（用于可视化）
x = xl: 0.01: xh;
y = (1.6*sin(x)) - x;
for n = 1:4  %  限定搜索迭代次数为4步
xm = (xh - L);  %  计算区间中点
a = xm - (L/3);  %  左内点（三等分区间的第一个分点）
ya = (1.6*sin(a)) - a;
b = xm + (L/3);  %  右内点（三等分区间的第二个分点）
yb = (1.6*sin(b)) - b;
if yb < ya
xh = b;  %  若右内点函数值更小，舍弃最右侧子区间，更新上界
end;
L =2*L/3;
%  绘图展示每一步迭代结果
figure(1)
subplot(2, 2, n);
plot(x, y, 'k');
axis([0.8, 1.12, 0, 0.4]);
hold on;
plot([a, a], [0, ya ], 'b--');
plot([b, b], [0, yb ], 'r--');
plot([xm, xm], [0, 0.36], 'g');
end;
