% 例程 2.10  二次插值模型的应用
%  函数：y = 2.1(x ^3) + 7/x，区间范围：[0.2, 2]
%  第一步：绘制函数曲线
x = 0.2: 0.01: 2;
y = (2.1*(x.^3)) + (7./x);
figure(1)
plot(x, y, 'k');
hold on;
%  选取3个采样点
x1 = 0.4;  y1 = (2.1*(x1^3)) + (7/x1);
x2 = 0.7;  y2 = (2.1*(x2^3)) + (7/x2);
x3 = 1.5;  y3 = (2.1*(x3^3)) + (7/x3);
%  通过线性方程组 Ac = b 求解模型系数
A = [1, x1, x1^2; 1, x2, x2^2; 1, x3, x3^2];
b = [ y1; y2; y3];
c = A\b;
%  绘制二次插值模型曲线与3个采样点
x = 0.3: 0.01: 1.8;  %  模型曲线的绘制区间（更短的取值范围）
M = c(1) + (c(2).*x) + (c(3)*x.^2);
plot(x, M, 'r--');
plot(x1, y1, 'bo', 'MarkerSize', 10);
plot(x2, y2, 'bo', 'MarkerSize', 10);
plot(x3, y3, 'bo', 'MarkerSize', 10);
%  计算并绘制二次模型的极小值点
mx = -c(2)/(2*c(3));
my = c(1) + (c(2)*mx) + (c(3)*mx^2);
plot(mx, my, 'rd', 'MarkerSize', 10);
%  计算并绘制原函数在mx处的函数值
qy = (2.1*(mx^3)) + (7/mx);
plot(mx, qy, 'b*', 'MarkerSize', 10);
mx
