% 例程 3.12  简单食谱问题的可行域
%  绘制二维可行解集
%  直线方程：ax + by = c
a1 = 7;
b1 = 1.3;
c1 = 10;
a2 = 106;
b2 = 97;
c2 = 300;
%  目标函数：z = ax + by
a = 10;
b = 1.4;
%  约束直线的角点坐标
X1 = c1/a1;
Y1 = c1/b1;
X2 = c2/a2;
Y2 = c2/b2;
%  目标函数直线的角点坐标
z = 9;
Zx = z/a;
Zy = z/b;
%  计算两条约束直线的交点
aux1 = (Y2 - Y1);
aux2 = (Y2*X1) - (Y1*X2);
xi = (X1*X2*aux1)/aux2;
yi = Y1 - ((Y1*xi)/X1);
figure(1)
%  绘制坐标轴
plot([-1, 4], [0, 0], 'b');
hold on;
plot([0, 0], [-2, 10], 'b');
xlabel('x1, 奶酪');  ylabel('x2, 土豆');
%  绘制可行解集
patch([0, 0, xi], [Y2, Y1, yi], 'g');
%  绘制约束直线
plot([0, X1], [Y1, 0], 'k');
plot([0, X2], [Y2, 0], 'k');
%  绘制目标函数直线
plot([0, Zx], [Zy, 0], 'm');
grid on;
