% 例程 3.8  可行域无界的案例
%  绘制二维可行解集
%  直线方程：ax + by = c
a1 = -3;
b1 = 2;
c1 = 3;
a2 = -1;
b2 = 2;
c2 = 8;
%  约束条件的角点坐标
X1 = c1/a1;
Y1 = c1/b1;
X2 = c2/a2;
Y2 = c2/b2; 
%  计算两条约束直线的交点
aux1 = (Y2 - Y1);
aux2 = (Y2*X1) - (Y1* X2);
xi = (X1*X2*aux1)/aux2;
yi = Y1 - ((Y1*xi)/X1);
%  最右侧点（在第二条约束直线上）
xr = 3*xi;
yr =(c2 - (a2*xr))/b2;
figure(1)
%  绘制可行解集（无界区域）
patch([0, 0, xi, xr, xr], [0, Y1, yi, yr, 0], 'g', 'EdgeColor', 'g');
hold on;
%  绘制坐标轴
plot([-2, 10], [0, 0], 'b');
plot([0, 0], [-2, 10], 'b');
%  绘制约束直线
plot([0, xi], [Y1, yi], 'k');
plot([xi, xr], [yi, yr], 'k');
%  绘制箭头（指示无界方向）
quiver([6.5, 6.5], [2, 5], [1, 1], [0, 0], 'k');
