% 例程 3.9  约束无界且解无界的案例
%  绘制二维可行解集与目标函数
%  直线方程：ax + by = c
a1 = -3;
b1 = 2;
c1 = 3;
a2 = -1;
b2 = 2;
c2 = 8;
%  约束条件的角点坐标
X1 = c1/a1;
Y1 = c1/b1;
X2 = c2/a2;
Y2 = c2/b2;
%  计算两条约束直线的交点
aux1 = (Y2 - Y1);
aux2 = (Y2*X1) - (Y1*X2);
xi = (X1*X2*aux1)/aux2;
yi = Y1 - ((Y1*xi)/X1);
%  最右侧点（在第二条约束直线上）
xr = 3.5*xi;
yr = (c2 - (a2*xr))/b2;
figure(1)
%  绘制可行解集（无界区域）
patch([0, 0, xi, xr, xr], [0, Y1, yi, yr, 0], 'g', 'EdgeColor', 'g');
hold  on;
%  绘制坐标轴
plot([-2, 10], [0, 0], 'b');
plot([0, 0], [-2, 10], 'b');
%  绘制约束直线
plot([0, xi], [Y1, yi], 'k');
plot([xi, xr], [yi, yr], 'k');
%  绘制箭头（指示无界方向）
quiver([7.8, 7.8], [2, 5], [1, 1], [0, 0], 'k');
%  绘制目标函数值对应的直线段
%  目标函数：2x + y = z;
a = 2;
b = 1;
%  目标函数直线段的端点坐标
z = 4;
X1 = z/a;
Y1 = z/b;
z = 8;
X2 = z/a;
Y2 = z/b;
z = 12;
X3 = z/a;
xl3 = X3 - 5;
yl3 = z - (a*xl3);
z = 16;
X4 = z/a;
xl4 = X4 - 5;
yl4 =z - (a*xl4);
plot([0, X1], [Y1, 0], 'r');
plot([0, X2], [Y2, 0], 'r');
plot([xl3, X3], [yl3, 0], 'r');
plot([xl4, X4], [yl4, 0], 'r');
