% 例程 3.7  绘制约束条件不一致的案例
%  绘制二维可行解集
%  直线方程：ax + by = c
a1 = -1;
b1 = 2;
c1 = 2;
a2 = -1;
b2 = 1;
c2 = 2;
%  约束条件的角点坐标
X1 = c1/a1;
Y1 = c1/b1;
X2 = c2/a2;
Y2 = c2/b2; 
%  最右侧点的横坐标
xr = 6;
yr1 = (c1 - a1*xr))/b1;
yr2 = (c2 - (a2*xr))/b2;
figure(1)
%  绘制（理论上的）可行域区域（无重叠，实际为空）
patch([0, 0, xr, xr], [0, Y1, yr1, 0], 'c', 'EdgeColor', 'c');
hold on;
patch([0, 0, xr, xr], [Y2, yr2+1, yr2+1, yr2], 'c', 'EdgeColor', 'c');
%  绘制坐标轴
plot([-2, 8], [0, 0], 'b');
plot([0, 0], [-2, 10], 'b');
%  绘制约束直线
plot([0, xr],[Y1, yr1], 'k');
plot([0, xr],[Y2, yr2], 'k');
% 绘制箭头（指示约束方向）
quiver([5.7, 5.7], [1, 2.5, [1, 1], [0, 0], 'k');
quiver([2, 4], [8.3, 8.3], [0, 0],[1, 1], 'k');
