% 例程 3.5  绘制待研究案例的可行解集
%  绘制二维可行解集，单纯形表示例
%  直线方程：ax + by = c
a1 = 4;
b1 = 1;
c1 = 160;
a2 = 2;
b2 = 3;
c2 = 240;
%  约束条件的角点坐标
X1 = c1/a1;
Y1 = c1/b1;
X2 = c2/a2;
Y2 = c2/b2; 
%  计算约束直线的交点
aux1 = (Y2 - Y1);
aux2 = (Y2*X1) - (Y1*X2);
xi = (X1*X2*aux1)/aux2;
yi = Y1 - ((Y1*xi)/X1);
figure(1)
%  绘制坐标轴
plot([-20, 140], [0, 0], 'b'); 
hold on;
plot([0, 0], [-20, 180], 'b');
%  绘制可行解集（填充区域）
patch([0, 0, xi, X1], [0, Y2, yi, 0], 'g');
%  绘制约束直线
plot([0, X1], [Y1, 0], 'k');
plot([0, X2], [Y2, 0], 'k');
